hwreverse/CoursPCBDesign/docs/SRC Firmware PIC/pic100.c
/* MD-100 compatible solid state mass storage device,
   to be compiled with the Microchip MCC18 compiler,
   microprocessor PIC18F4520 */

#include <p18cxxx.h>
#include <string.h>	/* memcmp, memcpy, memset */
#include <i2c.h>
#include "pic100.h"

#pragma config OSC = INTIO67
#pragma config PWRT = ON
#pragma config BOREN = SBORDIS
#pragma config BORV = 1
#pragma config WDT = OFF
#pragma config MCLRE = ON
#pragma config LPT1OSC = OFF
#pragma config PBADEN = OFF
#pragma config XINST = OFF
#pragma config DEBUG = OFF

#define	FOSC	4000000		/* clock frequency */

#define	SECTORS_PER_TRACK	16

/* file system parameters */
#define	SECTORS_FAT	4
#define	SECTORS_DIR	12
#define	START_FAT	0
#define	START_DIR	4
#define	START_DATA	16
#define	MAX_FILES	16	/* number of handles */
#define	SIZE_FILE_NAME	(8+3)
#define	SIZE_BLOCK	4	/* 4 sectors per block */
#define	SIZE_RECORD	256
#define	SIZE_FAT_ENTRY	2
#define	SIZE_DIR_ENTRY	sizeof (DIR_ENTRY)
#define	DIR_ENTRIES	(SECTORS_DIR * SIZE_RECORD / SIZE_DIR_ENTRY)
#define	RESERVED	(START_DATA / SIZE_FAT_ENTRY)
#define	EOF_CHAR	0x1A

#define	PAGESIZE	0x80	/* EEPROM Microchip 24LC1025 */
#define	SIZE_FAT_CHUNK	16	/* number of FAT entries read from the EEPROM
 while searching for a free cluster, suboptimal number would slow down the
 search (EEPROM access overhead when too low, often excessive amount of data
 read from the EEPROM when too high) */

/* port pins */
#define	SDA	RC4	/* I2C bus */
#define	SCL	RC3	/* I2C bus */
#define	GRN_LED	RC2	/* green LED driven in the PWM mode (CCP1) */
#define	PGMDATA	RB7	/* programming mode data input/output */
#define	PGMCLK	RB6	/* programming mode clock input */
#define	FD_DIR	RB0	/* transfer direction strobe signal input (P2) */
#define	FD_ACK	RA5	/* transfer direction acknowledge signal output (P0) */
#define	FD_PWR	RA4	/* power control signal input (P3) */


#pragma udata udata1

byte media;		/* set bits mark populated 64KB EEPROM blocks */
byte first_cntrl;	/* control byte for the first EEPROM block */
int dir_index;		/* index of a directory entry */
DIR_ENTRY debuf1;	/* directory entry read from / written to EEPROM */
DIR_ENTRY debuf2;	/* directory entry buffer ($2280) */
byte access[MAX_FILES];	/* access mode for each of 16 files ($00A9) */
word position[MAX_FILES];	/* current cluster index for each file on bits
 8..0 ($0110) and which sector in those clusters on bits 13..12 ($0130) */
volatile byte pspdata;	/* data received from the PSP port */

/* timers decremented every 1ms to 0 */
volatile byte prog_timer;	/* used for EEPROM programming */
volatile byte idle_timer;	/* sleep mode after time-out */

union {
  byte all;
  struct {
    unsigned END_OF_FILE:1;	/* ... or no more files */
    unsigned FILE_READ_ONLY:1;
    unsigned DATA_ERROR:1;
    unsigned RENAME_FAILED:1;
    unsigned FILE_FOUND:1;
    unsigned ALREADY_OPENED:1;	/* file already opened or file handle already
				   in use */
    unsigned ACCESS_ERROR:1;
    unsigned FILE_NOT_OPENED:1;
  } bits;
} fd_status;	/* status code of the operation ($0054) */

union {
  byte all;
  struct {
    unsigned LOW_BATTERIES:1;
    unsigned WRITE_PROTECTED:1;	/* disk write protected */
    unsigned NOT_READY:1;	/* disk not inserted */
    unsigned EEPROM_ACCESS:1;
    unsigned XX4:1;
    unsigned INVALID_COMMAND:1;
    unsigned DISK_FULL:1;
    unsigned OPENED_FILES:1;	/* format failed because of opened files */
  } bits;
} fd_error;	/* error code of the operation ($0055) */

word fd_counter;	/* counter of transferred bytes ($0062, $0063) */
byte fd_command;	/* command code ($0073) */
byte fd_handle;		/* file handle ($007A) */
word max_cluster;	/* ($0093, $0094) */

#pragma udata udata2

DIR_ENTRY fcb_table[MAX_FILES];	/* table of 16 File Control Blocks ($2290) */

#pragma udata udata3

byte secbuf[SIZE_RECORD];	/* sector buffer ($2400) */


#pragma code high_vector = 0x08
void high_vector (void)
{
  _asm
    goto high_isr
  _endasm
}
# pragma code


# pragma interrupt high_isr
void high_isr (void)
{
  if (PIR1bits.PSPIF)
  {
    PIR1bits.PSPIF = 0;
    if (TRISEbits.IBF)
    {
      pspdata = PORTD;
    }
    idle_timer = 0xFF;
    TRISCbits.GRN_LED = 0;	/* green LED on */
  }
  if (INTCONbits.INT0IF)
  {
    INTCONbits.INT0IF = 0;
    idle_timer = 0xFF;
    TRISCbits.GRN_LED = 0;	/* green LED on */
  }
  if (PIR1bits.TMR2IF)
  {
    PIR1bits.TMR2IF = 0;
    if (prog_timer)
    {
      --prog_timer;
    }
    if (idle_timer && !--idle_timer)
    {
      TRISCbits.GRN_LED = 1;	/* green LED off */
    }
  }
}
#pragma code


/* macro definitions */

/* receive a byte from the host, decrement 'fd_counter', terminate the command
   by sending 'fd_error.all' to the host when overflow */
#define	GetByteAndCnt	if (transf_and_cnt (0)) { put_byte (fd_error.all); return; }


/* receive a file name from the host, terminate the command by sending
   'fd_error.all' to the host when 'fd_counter' caused an overflow */
#define	GetFileName	if (get_block ((byte*) &debuf2, SIZE_DIR_ENTRY)) { put_byte (fd_error.all); return; }


/* if the request from the host is not equal zero, then terminate the command
   by sending 'fd_error.all' to the host */
#define	CheckRequest	if (pspdata) { put_byte (fd_error.all); return; }


/* if the 'fd_error.all' value is not equal zero, then terminate the command
   by sending 'fd_error.all' to the host */
#define	CheckFdError	if (fd_error.all) { put_byte (fd_error.all); return; }


byte ee_presence (byte control /* R/W bit should be 0 */)
{
  byte x;

  IdleI2C ();
  StartI2C ();
  while (SSPCON2bits.SEN);
  if (PIR2bits.BCLIF)
  {
    return -1;			/* bus collision */
  }

  SSPBUF = control;
  if (SSPCON1bits.WCOL)
  {
    StopI2C ();
    return -3;			/* write collision */
  }
  while (SSPSTATbits.BF);
  IdleI2C ();

  x = SSPCON2bits.ACKSTAT;
  StopI2C ();
  while (SSPCON2bits.PEN);
  if (PIR2bits.BCLIF)
  {
    return -1;			/* bus collision */
  }

  return (x) ? -2 /* Not Ack */ : 0 /* Ack */;
}


/* scan the I2C bus for populated EEPROM blocks */
void ee_scan (void)
{
  byte control;

  media = 0;
  max_cluster = 0;
  for (control = 0xA0; control < 0xA0+16; control += 2)
  {
    media >>= 1;
    if (!ee_presence (control))
    {
      media |= 0x80;
      max_cluster += 64;
    }
  }
}


/* This is an equivalent of the original EESequentialRead routine from the
   I2C library, but with two bytes of address data. */
byte ee_read (byte control, word address, byte *rdptr, byte length)
{
  idle_timer = 0xFF;
  IdleI2C ();
  StartI2C ();
  while (SSPCON2bits.SEN);
  if (PIR2bits.BCLIF)
  {
    return -1;			/* bus collision */
  }

  SSPBUF = control;
  if (SSPCON1bits.WCOL)
  {
    StopI2C ();  
    return -3;			/* write collision */
  }
  while (SSPSTATbits.BF);
  IdleI2C ();

