hwreverse/CoursPCBDesign/docs/SRC Firmware PIC/pic100.c
  if (SSPCON2bits.ACKSTAT)
  {
    StopI2C ();
    return -2;			/* Not Ack error */
  }

  SSPBUF = address>>8;
  if (SSPCON1bits.WCOL)
  {
    StopI2C ();
    return -3;			/* write collision */
  }
  while (SSPSTATbits.BF);
  IdleI2C ();

  if (SSPCON2bits.ACKSTAT)
  {
    StopI2C ();
    return -2;			/* Not Ack error */
  }

  SSPBUF = address;
  if (SSPCON1bits.WCOL)
  {
    StopI2C ();
    return -3;			/* write collision */
  }
  while (SSPSTATbits.BF);
  IdleI2C ();

  if (SSPCON2bits.ACKSTAT)
  {
    StopI2C ();
    return -2;			/* Not Ack error */
  }

  RestartI2C ();
  while (SSPCON2bits.RSEN);

  SSPBUF = control+1;
  if (SSPCON1bits.WCOL)
  {
    StopI2C ();
    return -3;			/* write collision */
  }
  while (SSPSTATbits.BF);
  IdleI2C ();

  if (SSPCON2bits.ACKSTAT)
  {
    StopI2C ();
    return -2;			/* Not Ack error */
  }

  do {
    SSPCON2bits.RCEN = 1;
    while (!SSPSTATbits.BF);
    *rdptr++ = SSPBUF;
    while (SSPCON2bits.RCEN);   
    if (PIR2bits.BCLIF)
    {
      return -1;		/* bus collision */ 
    }
    SSPCON2bits.ACKDT = (--length) ? 0 : 1 /* no Ack when last byte received */;
    SSPCON2bits.ACKEN = 1;
    while (SSPCON2bits.ACKEN);
  } while (length);

  StopI2C ();
  while (SSPCON2bits.PEN);
  if (PIR2bits.BCLIF)
  {
    return -1;			/* bus collision */
  }

  return 0;			/* no error */
}


/* This is a modification of the original EEPageWrite routine from the I2C
   library. */
byte ee_write (byte control, word address, byte *wrptr, byte length)
{
  idle_timer = 0xFF;
  IdleI2C ();
  StartI2C ();
  while (SSPCON2bits.SEN);
  if (PIR2bits.BCLIF)
  {
    return -1;			/* bus collision */
  }

  SSPBUF = control;
  if (SSPCON1bits.WCOL)
  {
    StopI2C (); 
    return -3;			/* write collision */
  }
  while (SSPSTATbits.BF);
  IdleI2C ();

  do {

/* write a memory block to the EEPROM, the start bit and the control byte are
  already successfully transmitted at this point */

    if (SSPCON2bits.ACKSTAT)
    {
      StopI2C (); 
      return -2;		/* Not Ack error */
    }

    SSPBUF = address>>8;
    if (SSPCON1bits.WCOL)
    {
      StopI2C ();
      return -3;		/* write collision */
    }
    while (SSPSTATbits.BF);
    IdleI2C ();

    if (SSPCON2bits.ACKSTAT)
    {
      StopI2C ();
      return -2;		/* Not Ack error */
    }

    SSPBUF = address;
    if (SSPCON1bits.WCOL)
    {
      StopI2C ();
      return -3;		/* write collision */
    }
    while (SSPSTATbits.BF);
    IdleI2C ();

    if (SSPCON2bits.ACKSTAT)
    {
      StopI2C ();
      return -2;		/* Not Ack error */
    }

    do {
      SSPBUF = *wrptr++;
      if (SSPCON1bits.WCOL)
      {
        StopI2C ();
        return -3;		/* write collision */
      }
      while (SSPSTATbits.BF);
      IdleI2C ();

      if (SSPCON2bits.ACKSTAT)
      {
        StopI2C ();
        return -2;		/* Not Ack error */
      }
    } while (--length && (++address % PAGESIZE));

    StopI2C ();
    while (SSPCON2bits.PEN);
    if (PIR2bits.BCLIF)
    {
      return -1;		/* bus collision */
    }

/* wait until the write cycle to the EEPROM is complete */

    IdleI2C ();
    StartI2C ();
    while (SSPCON2bits.SEN);
    if (PIR2bits.BCLIF)
    {
      return -1;		/* bus collision */
    }

    SSPBUF = control;
    if (SSPCON1bits.WCOL)
    {
      StopI2C ();
      return -3;		/* write collision */
    }
    while (SSPSTATbits.BF);
    IdleI2C ();

    prog_timer = 20;
    while (SSPCON2bits.ACKSTAT && prog_timer)
    {
      RestartI2C ();
      while (SSPCON2bits.RSEN);
      if (PIR2bits.BCLIF)
      {
        return -1;		/* bus collision */
      }

      SSPBUF = control;
      if (SSPCON1bits.WCOL)
      {
        StopI2C ();
        return -3;		/* write collision */
      }
      while (SSPSTATbits.BF);
      IdleI2C ();
    }

  } while (length && prog_timer);

  StopI2C ();
  while (SSPCON2bits.PEN);
  if (PIR2bits.BCLIF)
  {
    return -1;			/* bus collision */
  }

  return (prog_timer) ? 0 /* no error */ : -4 /* operation timed out */;
}


/* calculate the EEPROM control byte for the sector 'x' */
byte ee_cntrl (word x)
{
  byte block, mask, control;

  block = x >> 8;
  mask = 0x01;
  for (control = 0xA0; control < 0xA0+16; control += 2)
  {
    if (media & mask)
    {
      if (!block)
      {
        return control;
      }
      --block;
    }
    mask <<= 1;
  }
/* sector out of EEPROM space */
  return 0;
}


/* read sector 'x' to the 'secbuf' */
void read_sector (word x)
{
  byte y;

  if (	!(y = ee_cntrl(x)) ||
	ee_read (y, x * SIZE_RECORD, secbuf, (byte) SIZE_RECORD))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
}


/* write the 'secbuf' to the sector 'x' */
void write_sector (word x)
{
  byte y;

  if (	!(y = ee_cntrl(x)) ||
	ee_write (y, x * SIZE_RECORD, secbuf, (byte) SIZE_RECORD))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
}


void read_sec1 (word cluster, byte sector)
{
  read_sector ((cluster & 0x01FF) * SIZE_BLOCK + (word) sector);
}


void write_sec1 (word cluster, byte sector)
{
  write_sector ((cluster & 0x01FF) * SIZE_BLOCK + (word) sector);
}


/* read a directory entry 'x' to the 'debuf1' */
void read_dir_entry (word x)
{
  if (ee_read (first_cntrl, x * SIZE_DIR_ENTRY + START_DIR * SIZE_RECORD,
	(byte*) &debuf1, SIZE_DIR_ENTRY))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
}


/* write the 'debuf1' to the directory entry 'x' */
void write_dir_entry (word x)
{
  if (ee_write (first_cntrl, x * SIZE_DIR_ENTRY + START_DIR * SIZE_RECORD,
	(byte*) &debuf1, SIZE_DIR_ENTRY))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
}


/* value of a word in big endian order pointed to by 'ptr' */
word big_endian_word (byte *ptr)
{
  byte x;

  x = *ptr;
  return (((word) x) << 8) | (word) *++ptr;
}


/* read a FAT entry 'x' */
word read_fat_entry (word x)
{
  byte buf[SIZE_FAT_ENTRY];

  x &= 0x01FF;
  if (ee_read (first_cntrl, x * SIZE_FAT_ENTRY + START_FAT * SIZE_RECORD,
	buf, SIZE_FAT_ENTRY))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
  return big_endian_word (buf);
}


/* read 'i' FAT entries starting from 'x' to the 'secbuf'  */
void read_fat_entries (word x, byte i)
{
  x &= 0x01FF;
  if (ee_read (first_cntrl, x * SIZE_FAT_ENTRY + START_FAT * SIZE_RECORD,
	secbuf, i * SIZE_FAT_ENTRY))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
}


/* write 'y' to a FAT entry 'x' */
void write_fat_entry (word x, word y)
{
  byte buf[SIZE_FAT_ENTRY];

  buf[0] = y >> 8;
  buf[1] = y;
  x &= 0x01FF;
  if (ee_write (first_cntrl, x * SIZE_FAT_ENTRY + START_FAT * SIZE_RECORD,
	buf, SIZE_FAT_ENTRY))
  {
    fd_error.bits.EEPROM_ACCESS = 1;
  }
}


void write_last_fat_entry (word cluster, byte sector)
{
  word x;

  x = (cluster & 0x01FF) | 0xC000 /* used entry + end of chain */;
  if (sector & 0x01)
  {
    x |= 0x1000;
  }
  if (sector & 0x02)
  {
    x |= 0x2000;
  }
  write_fat_entry (cluster, x);
}


/* receive the 16-bit number of transferred bytes 'fd_counter' from the host */
void get_num_bytes (void)
{
  transfer (0);
  fd_counter = (word) pspdata;		/* number of bytes, LSB */
  transfer (0);
  fd_counter |= ((word) pspdata) << 8;	/* number of bytes, MSB */
}


/* receive 'size' bytes from the host to a memory area pointed to by 'ptr',
   return a value <> 0 when 'fd_counter' overflow occurred */
byte get_block (byte *ptr, word size)
{
  do {
    *ptr++ = pspdata;
    if (!--size)
    {
      return 0;
    }
  } while (!transf_and_cnt (0));
  return 1;
}


/* send 'size' bytes pointed to by 'ptr' to the host */
byte put_block (byte *ptr, word size)
{
  while (size)
  {
    wait_for_rd_mode ();
    if (pspdata)
    {
      put_byte (fd_error.all);
      return 1;		/* transfer terminated by the host */
    }
    put_byte (*ptr++);
    --size;
  }
  return 0;		/* OK */
}


