hwreverse/CoursPCBDesign/docs/SRC Firmware PIC/pic100.c
/* receive 'fd_counter'+1 bytes from the host to the 'secbuf'
   (replaces duplicate code blocks: $077B..$0793, $12BA..$12D3+$12DB..$12DE,
   $144D..$1468) */
byte* get_record (void)
{
  byte *ptr;

  ptr = secbuf;
  while (1)
  {
    *ptr = pspdata;
    if (ptr < secbuf+SIZE_RECORD-1)
    {
      ++ptr;
    }
    if (fd_counter == 0)
    {
      break;
    }
    --fd_counter;
    transfer (0);
  }
  return ptr;
}


/* find the last cluster of the file starting from a given index
   (replaces duplicate code blocks: $093E..$095A, $13AA..$13CB) */
word find_last_clus (word x /* cluster index */)
{
  do {
    x = read_fat_entry (x);	/* last chain entry points to itself */
  } while (!(x & 0x4000) && !fd_error.all);
  return x;
}


/* free the FAT chain starting from a given index up to the end
   (replaces duplicate code blocks: $0A26..$0A4D, $0C50..$0C77) */
void free_fat_chain (word x /* cluster index */)
{
  word y;

  do {
    y = read_fat_entry (x);
    write_fat_entry (x, 0);
    x = y;
  } while (!(y & 0x4000) && !fd_error.all);
}


/* wait until the host sends a byte then switches back to read mode */
void wait_for_rd_mode (void)
{
  while (PORTBbits.FD_DIR)
  {
    if (TRISCbits.GRN_LED)
    {
      _asm
      sleep
      _endasm
    }
  }
}


void main (void)
{
  OSCCON = 0x60;		/* 4MHz, only PIC18F4520 */
/* unused pins are configured as outputs */
  ADCON1 = 0x0F;		/* digital I/O, value 0x07 for PIC18F452 */
  TRISA = 0x10;
  TRISB = 0xE1;
  TRISC = 0xDC;
  TRISD = 0xFF;
  TRISE = 0x17;			/* enable the PSP port */
  PORTD = 0x55;			/* identification byte (Option Code) */
  PORTAbits.FD_ACK = 0;
  idle_timer = 0;

/* the CCP1 pin drives a green LED in the PWM mode
   Timer2 generates an interrupt every 1ms
   external interrupt0 on falling edge */
#define	val1 (FOSC/4/4/1000-1)
#define val2 ((val1*4)/5)	/* PWM duty cycle */
  PR2 = val1;
  CCPR1L = val2;
  T2CON = 0x1C;		/* Timer2 enabled, postscaler by 4 */
  CCP1CON = 0x0C;	/* PWM mode */
  RCONbits.IPEN = 1;	/* enable priority levels */
  IPR1 = 0x82;		/* PSP+Timer2 high priority */
  PIE1 = 0x82;		/* PSP+Timer2 interrupt enable */
  INTCON2bits.INTEDG0 = 0;	/* external interrupt0 on falling edge */
  INTCONbits.INT0IE = 1;	/* enable external interrupt0 */
  INTCONbits.GIEH = 1;	/* enable high priority peripheral interrupts */

/* I2C */
  SSPADD = FOSC/4/100000-1;	/* SCL frequency = ca. 100kHz */
  OpenI2C (MASTER, SLEW_OFF);

  ee_scan ();
/* if (!media) then ??? */
  first_cntrl = ee_cntrl (0);
  dir_index = 0;
  close_all ();

  while (1)
  {
/* 01D2: */
    fd_error.all = 0;
    fd_status.all = 0;
    wait_for_rd_mode ();
    fd_command = pspdata;
    switch (fd_command & 0xF0)
    {
      case 0x00:	/* read a directory entry */
        fd_cmd_0x ();
        break;
      case 0x10:	/* write to a file */
        fd_cmd_1x ();
        break;
      case 0x20:	/* read from a file */
        fd_cmd_2x ();
        break;
      case 0x30:	/* open file */
        fd_cmd_3x ();
        break;
      case 0x40:	/* close file(s) */
        fd_cmd_40 ();
        break;
      case 0x50:	/* delete file */
        fd_cmd_50 ();
        break;
      case 0x60:	/* rename file */
        fd_cmd_60 ();
        break;
      case 0x70:	/* write physical sector */
        fd_cmd_70 ();
        break;
      case 0x80:	/* read physical sector */
        fd_cmd_80 ();
        break;
      case 0x90:	/* format disk */
        fd_cmd_90 ();
        break;
      case 0xc0:	/* get the file size */
        fd_cmd_c0 ();
        break;
      case 0xd0:	/* get the free EEPROM space */
        fd_cmd_d0 ();
        break;
      default:
        fd_error.bits.INVALID_COMMAND = 1;
        put_byte (fd_error.all);
    }
  }
}


/* $02AB: command $90 - format disk */
void fd_cmd_90 (void)
{
/* $02E7: check if all files are closed */
  for (fd_handle=0; fd_handle<MAX_FILES; ++fd_handle)
  {
    if (fcb_table[fd_handle].type)
    {
      fd_error.bits.OPENED_FILES = 1;
      break;
    }
  }
  memset ((void*) secbuf, 0xFF, RESERVED);
  memset ((void*) secbuf+RESERVED, 0, SIZE_RECORD-RESERVED);
  for (fd_counter=START_FAT; !fd_error.all && fd_counter<START_DATA;
	++fd_counter)
  {
    write_sector (fd_counter);
    memset ((void*) secbuf, 0, RESERVED);
  }
  put_byte (fd_error.all);
}


/* $02D8: transmit data byte to the host */
void put_byte (byte x)
{
  TRISEbits.OBF = 0;
  PORTD = x;
  PORTAbits.FD_ACK = 1;		/* data ready for the host */
/* wait until the host reads the byte and switches to write mode */
  while (!PORTBbits.FD_DIR);
  PORTAbits.FD_ACK = 0;		/* acknowledge the host write mode */
}


/* $0705: single transfer transaction - send a byte to the host, then wait
   until the host sends a byte */
void transfer (byte x)
{
  put_byte (x);
  wait_for_rd_mode ();
}


/* $0711: command $80 - read physical sector */
void fd_cmd_80 (void)
{
  word i;

  transfer (0);				/* track */
  i = SECTORS_PER_TRACK * (word) pspdata;
  transfer (0);				/* sector */
  i += (word) --pspdata;	/* disk sectors are numbered from 1 up */
  read_sector (i);
  put_byte (fd_error.all);
  if (!fd_error.all)
  {
    put_block (secbuf, SIZE_RECORD);
  }
}


/* $074B: command $70 - write physical sector */
void fd_cmd_70 (void)
{
  word i, y;

  get_num_bytes ();
  GetByteAndCnt
  GetByteAndCnt				/* track */
  i = SECTORS_PER_TRACK * (word) pspdata;
  GetByteAndCnt				/* sector */
  i += (word) --pspdata;	/* disk sectors are numbered from 1 up */
  if (!transf_and_cnt (0))
  {
    y = fd_counter;
    get_record ();
    if (y == SIZE_RECORD-1)
    {
      write_sector (i);
    }
  }
  put_byte (fd_error.all);
}


/* $07A5: single transfer transaction,
   decrement the 16-bit 'fd_counter',
   return a value <> 0 when overflow */
byte transf_and_cnt (byte x)
{
  put_byte (x);
  if (fd_counter == 0)
  {
    return 1;
  }
  --fd_counter;
  wait_for_rd_mode ();
  return 0;
}


/* $0801: command $3x - open a file */
void fd_cmd_3x (void)
{
  DIR_ENTRY *myfcb;
  byte n, *ptr;
  word x;
  int i;

  get_num_bytes ();
  GetByteAndCnt
  GetByteAndCnt
  fd_handle = pspdata;
  GetByteAndCnt
  GetFileName
/* check whether the file isn't already opened or the handle already taken */
  for (n=0; n<MAX_FILES; ++n)
  {
    myfcb = &fcb_table[n];
    if (myfcb->type && (n==fd_handle ||
	!memcmp ((void*) &debuf2.name, (void*) &myfcb->name, SIZE_FILE_NAME)))
    {
      fd_status.bits.ALREADY_OPENED = 1;
      finish1 ();
      return;
    }
  }
/* $0896: copy the specified file name to the 'fcb_table' */
  myfcb = &fcb_table[fd_handle];
  memcpy ((void*) myfcb, (void*) &debuf2, SIZE_DIR_ENTRY);
/* $08C8: store the file access mode */
  access[fd_handle] = fd_command;
/* $08DB: */
  dir_index = -1;	/* no free directory entry found yet */
  i = find_dir_entry (-1);

  if (i >= 0)
  {
/* $08E9: open an existing file */
    myfcb->ublk = debuf1.ublk;
    myfcb->lblk = debuf1.lblk;
    x = big_endian_word (&debuf1.ublk);
/* $092D: */
    if (debuf1.attr)
    {
      fd_status.bits.FILE_READ_ONLY = 1;
    }

    if (fd_command & 0x04)
    {
/* $093B: open an existing file for append */
      if (!fd_status.bits.FILE_READ_ONLY)
      {
        x = find_last_clus (x);
        if (!fd_error.all)
        {
/* $095B: */
          read_sec1 (x, last_sectors (x));
          if (!fd_error.all)
          {
/* $0975: */
            ptr = end_of_record ();
            finish3 ((ptr) ? ptr-secbuf : 0);
            return;
          }
        }
      }
    }

    else if (fd_command & 0x02)
    {
/* $0A05: open an existing file for input */
      position[fd_handle] = x & 0x01FF;
      finish3 (0);		/* no terminating record will be returned */
      return;
    }

    else if (fd_command & 0x01)
    {
/* $0A20: open an existing file for random output */
      finish3 (0);		/* no terminating record will be returned */
      return;
    }

    else
    {
/* $0A23: open an existing file for sequential output */
      if (!fd_status.bits.FILE_READ_ONLY)
      {
/* $0A26: */
        free_fat_chain (x);
        CheckFdError
/* $0A4E: */
        debuf1.type = debuf2.type;
        dir_index = i;
/* $0A72: */
        create_file ();
        if (!(fd_error.all))
        {
          myfcb->ublk = debuf1.ublk;
          myfcb->lblk = debuf1.lblk;
          finish1 ();
          return;
        }
      }
    }
  }

  else if (i == -1)
  {
/* $0A69: no existing file found, create a new one */
    if (!(fd_command & 0x06))		/* no input or append allowed */
    {
/* $0A78: */
      if (dir_index < 0)
      {
/* no free directory entry available */
        fd_error.bits.DISK_FULL = 1;
      }
      else
      {
/* $0A72: */
        memcpy ((void*) &debuf1, (void*) &debuf2, SIZE_DIR_ENTRY);
        create_file ();
        if (!(fd_error.all))
        {
          myfcb->ublk = debuf1.ublk;
          myfcb->lblk = debuf1.lblk;
          finish1 ();
          return;
        }
      }
    }
  }

