hwreverse/CoursPCBDesign/docs/SRC Firmware PIC/pic100.c
/* else an EEPROM access error occurred */

/* $0A7A: failed to open the file */
  myfcb->type = 0;		/* clear the 'fcb_table' entry */
  CheckFdError
  finish1 ();
}


/* $0988: common closing sequence */
void finish3 (word x /* size of the terminating record, 0 if not append */)
{
  x += 0x11;			/* status byte + directory entry size */
  transfer (0);
/* $0996: transmit the number of returned bytes to the host */
  CheckRequest
  transfer ((byte) x);		/* LSB */
  CheckRequest
  transfer ((byte) (x>>8));	/* MSB */
/* $09B8: transfer the 'fd_status' followed by the directory entry */
  CheckRequest
  fd_status.bits.FILE_FOUND = 1;
  put_byte (fd_status.all);
  if (!put_block ((byte*) &debuf1, SIZE_DIR_ENTRY))
  {
/* $09E2: transfer the contents of the terminating record */
    x -= 0x11;			/* back to the size of terminating record */
    put_block (secbuf, x);
  }
}


/* $0A72: create new file, sets 'fd_error.bits' if failed,
   expects directory entry data in 'debuf1' and an index of the directory
   entry in 'dir_index' */
void create_file (void)
{
  word x;

  x = find_free_clus (START_DATA/SIZE_BLOCK);
  if (!fd_error.all)
  {
/* $0AA6: save the number of the starting cluster to the directory entry */
    debuf1.ublk = x >> 8;
    debuf1.lblk = x;
/* $0AD6: save the directory entry to the EEPROM */
    write_dir_entry ((word) dir_index);
    if (!fd_error.all)
    {
/* $0ADD: allocate the data cluster in the FAT */
      write_last_fat_entry (x, 0);
      if (!fd_error.all)
      {
        clear_secbuf ();
        write_sec1 (x, 0);
      }
    }
  }
}


/* $0AFE: erase the contents of the 'secbuf' */
void clear_secbuf (void)
{
  secbuf[0] = EOF_CHAR;
  memset ((void*) secbuf+1, 0, SIZE_RECORD-1);
}


/* $0B2C: common closing sequence */
void finish1 (void)
{
  transfer (0);
  CheckRequest
  transfer (0x01);		/* number of returned bytes, LSB */
  CheckRequest
  transfer (0x00);		/* number of returned bytes, MSB */
  CheckRequest
  put_byte (fd_status.all);
}


/* $0BDE: command $50 - delete file */
void fd_cmd_50 (void)
{
  int i;	/* index of the directory entry */
  word x;	/* index of the starting cluster */

  get_num_bytes ();
  GetByteAndCnt
  GetByteAndCnt
/* $0BFA: receive the file name */
  GetFileName
/* $0C10: */
  i = find_dir_entry (-1);
  if (i >= 0)
  {
    fd_status.bits.FILE_FOUND = 1;		/* file of old name exists */
    if (debuf1.attr)
    {
      fd_status.bits.FILE_READ_ONLY = 1;	/* file is write protected */
    }
    else
    {
/* $0C27: free the directory entry */
      x = big_endian_word ((byte*) &debuf1.ublk);
      memset ((void*) &debuf1, 0, SIZE_DIR_ENTRY);
      write_dir_entry ((word) i);
      CheckFdError
/* $0C43: free the FAT chain */
      free_fat_chain (x);
    }
  }
  CheckFdError
  finish1 ();
}


/* $0C82: search the 'secbuf' for the last non-zero byte (which is assumed
   to be an 'EOF_CHAR') */
byte* end_of_record (void)
{
  byte *ptr;

  ptr = secbuf+SIZE_RECORD-1;
  while (!*ptr)
  {
    if (ptr == secbuf)
    {
      return (byte*) 0;	/* the buffer contains only zeros */
    }
    --ptr;
  }
  return ptr;		/* a non-zero byte found */
}


/* $0CAC: search the directory for the file name in the 'debuf2',
   returns the index of matching directory entry,
   or -1 when no matching directory entry was found,
   or -2 when an EEPROM access error occurred,
   also the procedure looks for the first free directory entry, result stored
   in the 'dir_index' variable */
int find_dir_entry (int x /* directory entry excluded from the search */)
{
  int i;
  for (i=0; i<DIR_ENTRIES; ++i)
  {
    if (i == x)
    {
      continue;
    }
    read_dir_entry ((word) i);
    if (fd_error.all)
    {
      return -2; /* scan prematurely terminated due to EEPROM access error */
    }
    if (debuf1.type)
    {
/* occupied directory entry */
      if (!memcmp ((void*) &debuf1.name, (void*) &debuf2.name, SIZE_FILE_NAME))
      {
        return i;	/* found matching directory entry */
      }
    }
    else
    {
/* free directory entry */
      if (dir_index < 0)	/* skip if free dir. entry already found */
      {
        dir_index = i;	/* first free directory entry */
      }
    }
  }
  return -1;	/* no matching directory entry found */
}


/* $0D6C: search the FAT for a free cluster starting from 'x' */
word find_free_clus (word x)
{
  byte *ptr;
  word y;

  y = x;
  ptr = secbuf+SIZE_FAT_CHUNK*SIZE_FAT_ENTRY;
  do {
    if (ptr > secbuf+SIZE_FAT_CHUNK*SIZE_FAT_ENTRY-1)
    {
      read_fat_entries (x, SIZE_FAT_CHUNK);
      if (fd_error.all)
      {
        return 0;	/* EEPROM access error */
      }
      ptr = secbuf;
    }
    if (!(*ptr & 0x80))
    {
      return x;		/* found */
    }
    ptr += SIZE_FAT_ENTRY;
    if (++x == max_cluster)
    {
/* continue from the beginning of the FAT */
      x = START_DATA/SIZE_BLOCK;
      ptr = secbuf+SIZE_FAT_CHUNK*SIZE_FAT_ENTRY;
    }
  } while (x != y);
  fd_error.bits.DISK_FULL = 1;
  return 0;		/* not found */
}


/* $0DF8: command $60 - rename file */
void fd_cmd_60 (void)
{
  int i, y;
  byte save_type;	/* ($009B) */
  byte save_ublk;	/* ($0098) */
  byte save_lblk;	/* ($0099) */
  byte save_attr;	/* ($0095) */

  get_num_bytes ();
  GetByteAndCnt
  GetByteAndCnt
/* $0E18: receive the old file name */
  GetFileName
  i = find_dir_entry (-1);
  save_type = debuf1.type;
  save_ublk = debuf1.ublk;
  save_lblk = debuf1.lblk;
  save_attr = debuf1.attr;
  GetByteAndCnt
  GetByteAndCnt
/* $0E87: receive the new file name */
  GetFileName
  if (i >= 0)
  {
    fd_status.bits.FILE_FOUND = 1;		/* file of old name exists */
/* $0E99: if the attribute field of the new file name contains $FF, then
   the old file attribute will be preserved */
    if (debuf2.attr == 0xFF && (debuf2.attr = save_attr))
/* the second term is actually an assignment, not a comparison! */
    {
      fd_status.bits.FILE_READ_ONLY = 1;	/* file is write protected */
    }
    else
    {
/* $0EAA: copy the file type and starting cluster from the old file to the
   new one */
      debuf2.ublk = save_ublk;
      debuf2.lblk = save_lblk;
      debuf2.type = save_type;
      if ((y = find_dir_entry (i)) >= 0)
      {
/* $0EC4: file of the new name already exists */
        fd_status.bits.RENAME_FAILED = 1;
      }
      else if (y == -1)
      {
/* $0EDF: file of the new name doesn't exist */
        memcpy ((void*) &debuf1, (void*) &debuf2, SIZE_DIR_ENTRY);
        write_dir_entry ((word) i);
      }
/* otherwise an EEPROM access error occurred */
    }
  }
  CheckFdError
  finish1 ();
}


/* $0F02: command $0x - read a directory entry */
void fd_cmd_0x (void)
{
  int i, step;

  switch (fd_command)
  {
    case 0x00:		/* read the first directory entry */
      i = -1;
      step = 1;
      break;
    case 0x01:		/* read the next directory entry */
      i = dir_index;
      step = 1;
      break;
    default:		/* read the previous directory entry */
      i = dir_index;
      step = -1;
  }
  while ((i += step) >= 0 && i < DIR_ENTRIES)
  {
    read_dir_entry ((word) i);
    CheckFdError
    if (debuf1.type)
    {
/* $0F9D: found an occupied directory entry */
      dir_index = i;
      fd_status.bits.FILE_FOUND = 1;
      transfer (0);
      CheckRequest
      transfer (0x11);		/* number of returned bytes, LSB */
      CheckRequest
      transfer (0x00);		/* number of returned bytes, MSB */
      CheckRequest
      put_byte (fd_status.all);
/* $0FD6: transfer the directory entry */
      put_block ((byte*) &debuf1, SIZE_DIR_ENTRY);
      return;
    }
  }
/* $0F98: out of the directory area, no occupied directory entry found */
  fd_status.bits.END_OF_FILE = 1;
  finish1 ();
}


/* $1028: command $1x - write to a file */
void fd_cmd_1x (void)
{
  DIR_ENTRY *myfcb;
  byte *ptr;
  word x;	/* next cluster in chain */
  word y;
  word z;	/* current cluster */
  byte var88;	/* destination sector in the destination cluster ($0088) */
  byte var95;	/* access mode the file was opened for ($0095) */
  byte var9c;	/* last sector in the last cluster ($009C) */
  byte flag;

  get_num_bytes ();
  GetByteAndCnt
  GetByteAndCnt
  fd_handle = pspdata;
  myfcb = &fcb_table[fd_handle];
  x = big_endian_word ((byte*) &myfcb->ublk);

