hwreverse/CoursPCBDesign/docs/SRC Firmware PIC/pic100.c
/* $105F: */
  if (!myfcb->type)
  {
/* $1067: file not opened */
    fd_status.bits.FILE_NOT_OPENED = 1;
    if (transf_and_cnt (0))
    {
      finish1 ();
      return;
    }
  }
  else
  {
/* $1073: file opened */
    if (transf_and_cnt (0))
    {
      finish1 ();
      return;
    }
/* $1080: */
    var95 = access[fd_handle];
  }

/* $1095: */
  if (fd_command & 0x01)
  {
/* $109B: random writing */
    if (!(var95 & 0x01))	/* skip if file opened for random access */
    {
      fd_status.bits.ACCESS_ERROR = 1;
    }
/* $10A0: */
    y = (word) pspdata;			/* record, LSB */
    GetByteAndCnt
    y |= ((word) pspdata) << 8;		/* record, LSB */
    --y;			/* the records are numbered from 1 up */
/* $10B2: */
    if (transf_and_cnt (0))
    {
      finish1 ();
      return;
    }
/* $10BA: */
    if (fd_status.all)
    {
/* $10BE: illegal access mode, random writing to a file opened for sequential
   access */
      get_record ();
      finish1 ();
      return;
    }
/* $10C7: random writing to a file opened for random access */
    var88 = ((byte) y) % SIZE_BLOCK;	/* which sector in the cluster */
    y /= SIZE_BLOCK;			/* number of clusters to skip */
/* $10E2: this loop skips the requested number of clusters */
    do {
      z = x;
      x = read_fat_entry (z);
      CheckFdError
      if (x & 0x4000)
      {
/* $110C: end of the FAT chain encountered */
        var9c = last_sectors (x);
        read_sec1 (z, var9c);
        CheckFdError
        ptr = end_of_record ();
        if (!ptr || *ptr != EOF_CHAR)
        {
/* $113A: */
          fd_status.bits.DATA_ERROR = 1;
          get_record ();
          finish1 ();
          return;
        }
/* $1145: */
        *ptr = 0;	/* clear the End Of File mark 'EOF_CHAR' */
        flag = 0;
        while (y || var88 != var9c)
        {
/* $1177: this loop extends the file to the position being written */
          write_sec1 (z, var9c);
          CheckFdError
          if (++var9c > SIZE_BLOCK-1)
          {
            var9c = 0;
            --y;
            x = find_free_clus (z);
            CheckFdError
            write_fat_entry (z, x | 0x8000 /* used entry */);
            CheckFdError
            write_last_fat_entry (x, 0);
            CheckFdError
            z = x;
            flag = 0;	/* because 'find_free_cluster' uses 'secbuf' */
          }
          if (!flag)
          {
            memset ((void*) secbuf, 0, SIZE_RECORD);
            flag = -1;
          }
        }
        if (flag)
        {
          write_last_fat_entry (x, var9c);
          CheckFdError
        }
        break;		/* y=0, append at the end of file */
      }
    } while (y--);
/* $10F1: specified cluster found before the end of file, y = -1 */
  }

  else
  {
/* $1391: sequential writing */
    if (fd_status.all)
    {
      get_record ();
      finish1 ();
      return;
    }
    if (var95 & 0x03)
    {
/* $139D: sequential writing to a file opened for random access or for input */
      fd_status.bits.ACCESS_ERROR = 1;
      get_record ();
      finish1 ();
      return;
    }
/* $13AA: sequential writing to a file opened for sequential access */
    x = z = find_last_clus (x);
    CheckFdError
    var88 = last_sectors (z);
    y = 0;
  }

  if (y)
  {
/* $1430: writing before the end of the file, read-modify-write operation */
    read_sec1 (z, var88);
    CheckFdError
/* $143D: receive a record from the host and write it to the sector 'z' */
    get_record ();
    write_sec1 (z, var88);
    CheckFdError
  }
  else
  {
/* appending at the end of the file */
    y = fd_counter;
    x = z;		/* not really neccessary */
    if (var88 == 3 && y >= SIZE_RECORD-1)
    {
/* $13FE: another cluster needs to be allocated for the terminating record
   containing only an 'EOF_CHAR' */
      x = find_free_clus (z);
      CheckFdError
    }
/* $1425: -> $12BA: */
    memset ((void*) secbuf, 0, SIZE_RECORD);
    ptr = get_record ();
    if (y < SIZE_RECORD-1)
    {
      *ptr = EOF_CHAR;
    }
    write_sec1 (z, var88);
    CheckFdError
    if (y >= SIZE_RECORD-1)
    {
      clear_secbuf ();
      ++var88;
      var88 %= SIZE_BLOCK;
      write_sec1 (x, var88);
      CheckFdError
/* allocate the new sector in the FAT */
      if (var88)
      {
/* sector in the same cluster */
        write_last_fat_entry (z, var88);
      }
      else
      {
/* sector in a new cluster */
        x &= 0x01FF;
        write_fat_entry (z, x | 0x8000 /* used entry */);
        CheckFdError
        write_last_fat_entry (x, 0);
      }
      CheckFdError
    }
  }

  finish1 ();
}


/* $1483: command $2x - read from a file */
void fd_cmd_2x (void)
{
  DIR_ENTRY *myfcb;
  byte *ptr;
  word x;	/* next cluster in chain */
  word y;
  word z;	/* current cluster */
  byte var88;	/* destination sector in the destination cluster ($0088) */
  byte var9c;	/* last sector in the last cluster ($009C) */

  get_num_bytes ();
  GetByteAndCnt
  GetByteAndCnt
  fd_handle = pspdata;
  myfcb = &fcb_table[fd_handle];
  if (!myfcb->type)
  {
    fd_status.bits.FILE_NOT_OPENED = 1;
    finish1 ();
    return;
  }

  if (fd_command & 0x01)
  {
/* $14DD: random reading */
    if (!(access[fd_handle] & 0x01))
    {
/* $14E0: file not opened for random access */
      fd_status.bits.ACCESS_ERROR = 1;
      finish1 ();
      return;
    }
/* $14E5: */
    GetByteAndCnt
    y = (word) pspdata;			/* record, LSB */
    GetByteAndCnt
    y |= ((word) pspdata) << 8;		/* record, LSB */
    --y;			/* the records are numbered from 1 up */
    var88 = ((byte) y) % SIZE_BLOCK;	/* which sector in the cluster */
    y /= SIZE_BLOCK;			/* number of clusters to skip */
    x = big_endian_word ((byte*) &myfcb->ublk);
/* $150F: this loop skips the requested number of clusters */
    do {
      z = x;
      x = read_fat_entry (z);
      CheckFdError
      if (x & 0x4000)
      {
/* $1534: end of the FAT chain encountered */
        if (y || var88 >= last_sectors (x))
        {
/* $154E: attempt to read the terminating record or past the end of file */
          fd_status.bits.DATA_ERROR = 1;
          finish1 ();
          return;
        }
      }
    } while (y--);
/* $151E: specified cluster found */
  }

  else
  {
/* $1553: sequential reading */
    z = position[fd_handle];
    var88 = last_sectors (z);
    x = read_fat_entry (z);
    CheckFdError
    if (x & 0x4000)		/* end of chain? */
    {
/* $1574: last cluster of the file */
      var9c = last_sectors (x);
      if (var88 > var9c)
      {
/* $158B: attempt to read past the end of file */
        fd_status.bits.END_OF_FILE = 1;
        finish5 (0);
        return;
      }
      if (var88 == var9c)
      {
/* $1587: last record of the file */
        fd_status.bits.END_OF_FILE = 1;
      }
    }
/* $1590: advance the position */
    if (!((position[fd_handle] += 0x1000) & 0x3000))	/* next sector */
    {
      position[fd_handle] = x & 0x01FF;			/* next cluster */
    }
  }

