hwreverse/CoursPCBDesign/docs/SRC Firmware PIC/pic100.c
/* $15D6: */
  read_sec1 (z, var88);
  CheckFdError
  if (!fd_status.bits.END_OF_FILE)
  {
/* $1649: not the last record of the file */
    y = SIZE_RECORD;
  }
  else
  {
/* $15EC: last record of the file */
    ptr = end_of_record ();
    y = (ptr) ? ptr-secbuf : 0;
  }
  finish5 (y);
}


/* $15FB: common closing sequence */
void finish5 (word x /* data block size */)
{
  transfer (0);
  CheckRequest
  ++x;					/* account for the status byte */
/* $160F: transmit the number of returned bytes to the host */
  transfer ((byte) x);			/* LSB */
  CheckRequest
  transfer ((byte) (x >> 8));		/* MSB */
  CheckRequest
/* $162A: transmit the status code followed by the data block to the host */
  put_byte (fd_status.all);
  --x;
  put_block (secbuf, x);
}


/* $1690: command $40 - close file */
void fd_cmd_40 (void)
{
  transfer (0);
  fd_handle = pspdata;
  if (fd_handle & 0x80)
  {
    close_all ();		/* close all files */
  }
  else
  {
    close_file ();		/* close a single file */
  }
  put_byte (fd_error.all);
}


/* $16C0: close a file */
void close_file (void)
{
/* clear the File Control Block */
  fcb_table[fd_handle].type = 0;
/* $16E6: clear the record index */
  position[fd_handle] = 0;
}


/* close all files */
void close_all (void)
{
  for (fd_handle=0; fd_handle<MAX_FILES; ++fd_handle)
  {
    close_file ();
  }
}


/* $1726: command $C0 - get the file size (number of records) */
void fd_cmd_c0 (void)
{
  DIR_ENTRY *myfcb;
  word i, x;

  transfer (0);
  fd_handle = pspdata;
  myfcb = &fcb_table[fd_handle];
  if (!myfcb->type)
  {
/* $1741: file not opened (file type = 0) */
    transfer (0);
    fd_status.bits.FILE_NOT_OPENED = 1;
    put_byte (fd_status.all);
  }
  else
  {
/* $1749: file opened (file type <> 0) */
    i = big_endian_word ((byte*) &myfcb->ublk);
    x = 0;
/* $175C: this loop follows the FAT chain counting the number of clusters
   occupied by the file */
    while (!((i = read_fat_entry (i)) & 0x4000) && !fd_error.all)
    {
      x += SIZE_BLOCK;
    }
/* $1797: end of chain */
    x += (word) last_sectors (i);
/* $17A8: the terminating record isn't included when a file is opened for
   random access */
    if (!(access[fd_handle] & 0x01))
    {
      ++x;
    }
/* The original MD-100 code ignores 'fd_error', because it uses a FAT copy in
   the RAM, so it doesn't read anything from the floppy disk.
   Let's report the EEPROM access errors with some 'fd_status' bit. */
    if (fd_error.all)
    {
      fd_status.bits.DATA_ERROR = 1;
    }
    finish2 (x);
  }
}


/* returns the number of occupied sectors in the last cluster - 1 specified
   by bits 5,4 of the upper byte of the last FAT entry
   (replaces repeated code blocks: $095B..$0966, $1797..$17A4) */
byte last_sectors (word lastfatentry)
{
  byte x;

  x = 0;
  if (lastfatentry & 0x2000)
  {
    x |= 0x02;
  }
  if (lastfatentry & 0x1000)
  {
    x |= 0x01;
  }
  return x;
}


/* $17B7: transfer 'fd_status.all' and the word 'x' to the host */
void finish2 (word x)
{
  transfer (0);
  CheckRequest
  transfer (fd_status.all);
  CheckRequest
  transfer ((byte) x);		/* LSB */
  CheckRequest
  put_byte ((byte) (x>>8));	/* MSB */
}


/* $17D5: command $D0 - get the free EEPROM space (number of free clusters) */
void fd_cmd_d0 (void)
{
  byte *ptr;
  word i, x;

  x = 0;
  ptr = secbuf+SIZE_RECORD;
  for (i=0; i<max_cluster; ++i)
  {
    if (ptr > secbuf+SIZE_RECORD-1)
    {
      read_fat_entries (i, SIZE_RECORD/SIZE_FAT_ENTRY);
      CheckFdError
      ptr = secbuf;
    }
    if (!(*ptr & 0x80))
    {
/* FAT entry marked as free, increment the number of free clusters */
      ++x;
    }
    ptr += SIZE_FAT_ENTRY;
  }
  finish2 (x);
}
